<?php

return [
    'cms'  => [
        
        'name' => 'সি.এম.এস',
        'names' => 'সি.এম.এস',
        'index' => [
            'title' => 'সি.এম.এস',
            'index' => 'ইনডেক্স'
        ],
        'view' => [
            'title' => 'সি.এম.এস ভিউ',
        ],
        'create' => [
            'title' => 'সি.এম.এস তৈরি করুন',
        ],

        'edit' => [
            'title' => 'সি.এম.এস এডিট করুন',
        ],

        'add_new' => 'নতুন সি.এম.এস যুক্ত',
        'save' => 'সেভ',
        'cms_all' => 'সকল সি.এম.এস',

        'form' => [
            'title' => 'টাইটেল',
            'slug' => 'স্লাগ',
            'description' => 'বিবরণ',
            'status' => 'স্ট্যাটাস',
            'category_id' => 'ক্যাটাগরি',
            'created_by' => 'তৈরি করেছেন',
            'action' => 'অ্যাকশন',
            'edit-button' => 'এডিট',
            'delete-button' => 'ডিলিট',
            'view-button' => 'ভিউ',
            'select_category' => 'ক্যাটাগরি সিলেক্ট করুন',

            'validation'    => [
                'title' => [
                    'required'  => 'ইংরেজি টাইটেল প্রয়োজন!',
                ],
                'description' => [
                    'required'  => 'ইংরেজি বিবরণ প্রয়োজন!',
                ],
                'private' => [
                    'required'  => 'প্রাইভেট প্রয়োজন!',
                ],
                'status' => [
                    'required'  => 'স্ট্যাটাস প্রয়োজন!',
                ],
                'category_id' => [
                    'required'  => 'ক্যাটেগরি প্রয়োজন!',
                ],
            ],
        ],

        'message' => [
            'store' => [
                'success' => 'সি.এম.এস যুক্ত করা হয়েছে!',
                'error'    => 'সমস্যা হয়েছে!',
            ],
            'update' => [
                'success' => 'সি.এম.এস আপডেট করা হয়েছে!',
                'error'    => 'সমস্যা হয়েছে!',
            ],
            'destroy' => [
                'success' => 'সি.এম.এস ডিলিট করা হয়েছে!',
                'error'    => 'সমস্যা হয়েছে!',
                'warning_last_cms' => 'শেষ সি.এম.এস মুলে ফেলা যাবে না!',
            ],
        ],
    ],

    'category' => [        
        'name' => 'সি.এম.এস ক্যাটাগরি',
        'names' => 'সি.এম.এস ক্যাটাগরি',
        'index' => [
            'title' => 'সি.এম.এস ক্যাটাগরি',
            'index' => 'ইনডেক্স'
        ],
        'create' => [
            'title' => 'সি.এম.এস ক্যাটাগরি তৈরি করুন',
        ],

        'edit' => [
            'title' => 'সি.এম.এস ক্যাটাগরি এডিট করুন',
        ],

        'add_new' => 'নতুন সি.এম.এস ক্যাটাগরি যুক্ত',
        'save' => 'সেভ',

        'form' => [
            'code' => 'কোড',
            'name' => 'নাম',
            'bn_name' => 'বাংলা নাম',
            'status' => 'স্ট্যাটাস',
            'action' => 'অ্যাকশন',
            'edit-button' => 'এডিট',
            'delete-button' => 'ডিলিট',

            'validation'    => [
                'name' => [
                    'required'  => 'নাম প্রয়োজন!',
                ],
                'code' => [
                    'required'  => 'কোড প্রয়োজন!',
                    'unique'  => 'এই কোড আগে থেকেই আছে!',
                ],
            ],
        ],

        'message' => [
            'store' => [
                'success' => 'সি.এম.এস ক্যাটেগরি যুক্ত করা হয়েছে!',
                'error'    => 'সমস্যা হয়েছে!',
            ],
            'update' => [
                'success' => 'সি.এম.এস ক্যাটেগরি আপডেট করা হয়েছে!',
                'error'    => 'সমস্যা হয়েছে!',
            ],
            'destroy' => [
                'success' => 'সি.এম.এস ক্যাটেগরি ডিলিট করা হয়েছে!',
                'error'    => 'সমস্যা হয়েছে!',
                'warning_last_cmscategory' => 'শেষ ক্যাটাগরি মুলে ফেলা যাবে না!',
            ],
            'status' => [
                'success' => 'স্ট্যাটাস আপডেট করা হয়েছে!',
                'error'    => 'সমস্যা হয়েছে!',
            ],
        ],
    ],

];
