<?php

return [

    'index' => [
        'title' => 'ব্যাকআপ',
    ],
    'form' => [
        'name' => 'নাম',
        'size' => 'সাইজ',
        'date' => 'তারিখ',
        'age' => 'বয়স',
        'action' => 'অ্যাকশান',
        'create' => 'এখনি ব্যাকআপ নিন',
        'edit' => 'এডিট',
        'delete' => 'ডিলিট',
        'download' => 'ডাউনলোড',
        'monitor' => 'মনিটর',
        'clean' => 'ক্লিন',
    ],

    'message' => [ 
        'backup' => [
            'success' => 'ব্যাকআপ তৈরি করা হয়েছে!',
            'error'   => 'সমস্যা হয়েছে!',
        ],

        'clean' => [
            'success' => 'ব্যাকআপ ক্লিন করা হয়েছে!',
            'error'   => 'সমস্যা হয়েছে!',
        ],

        'monitor' => [
            'success' => 'ব্যাকআপ মনিটর করা হয়েছে!',
            'error'   => 'সমস্যা হয়েছে!',
        ],

        'delete' => [
            'success' => 'ব্যাকআপ ডিলিট করা হয়েছে!',
            'error' => 'সমস্যা হয়েছে!',
        ],

        'error' => [
            'success' => 'ব্যাকআপ ফাইল পাওয়া যায়নি!',
            'error' => 'সমস্যা হয়েছে!',
        ],

        'abort' => 'ব্যাকআপ ফাইল পাওয়া যায়নি!', 
    ],
];
